name = "Guram"

#რალურად ყველა სტრინგი შეგვიძლია მივიჩნიოთ ასოების ტიპის ელემენტებისგან შემდგარ სიად
#char - Character ასე ინგლისურად
#სახელიდან ან ნებისმიერი სიტყვიდან შეგვიძლია გამოვიძახოთ ნებისმიერი შესაბამისი ნომრით გამოვიძახოთ, რომელსაც ვეძახით "Index"
#მეორე ასოს პრინტი გვინდა მაგალითად

print(name[1])

#ვითვლით სტიქონის სიგრძე

print(len(name))

#შევამოწმოთ რაიმე ელემენტის არსებობა მოცემულ სტრინგში

print("r" in name)

#Slicing

surname = "Veshaguri"
print(surname[2:6])

#პოზიტიური ნიშნულები

print(surname[:5])   #იგივეა რაც 0  დაიწყებს თავიდან
print(surname[5:])

#ნეგატირუი ნიშნულები

print(surname[-1])
print(surname[-8])
